/*    a[0]+0  a[0]+1  a[0]+2  a[0]+3
        |       |        |       |
		|       |        |       |
a+0-->  1       3        5       7

a+1-->  2       4        6       8

a+2-->  9      11       13      15
*/
#include<stdio.h>
int main()
{
	int a[3][4]={{1,3,5,7},{2,4,6,8},{9,11,13,15}};
	printf("%d\t%d\n",a,*a);		//0行地址,0行0列元素地址
	printf("%d\t%d\n",&a[0],&a[0][0]);		//0列0行元素地址
	printf("%d\t%d\n",a[1],a+1);	//1行0列元素地址,1行地址
	printf("%d\n",(a[1]-a[0])*sizeof(int));	//每行所占字节数
	printf("%d\t%d\n",&a[1][0],(*(a+1)+0));	//1行0列元素地址
	printf("%d\t%d\n",&a[2],a+2);			//2行首地址
	printf("%d\t%d\n",&a[2][0],*(a+2));     //2行0列元素地址
	printf("%d\t%d\n",a[1][1],*(*(a+1)+1));	//1行1列元素值
	printf("%d\t%d\n",*a[2],*(*(a+2)));		//2行0列元素值
	printf("%d\t%d\n",*a[1],*(a[1]+0));     //1行0列元素值
}